#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>


```

terraform
aws_ecr_repository.repo: Refreshing state... [id=ceiv001-ecr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.repo must be replaced
-/+ resource "aws_ecr_repository" "repo" {
      ~ arn                  = "arn:aws:ecr:eu-west-1:244530008913:repository/ceiv001-ecr" -> (known after apply)
      ~ id                   = "ceiv001-ecr" -> (known after apply)
      ~ name                 = "ceiv001-ecr" -> "glennbech-ecr-2001" # forces replacement
      ~ registry_id          = "244530008913" -> (known after apply)
      ~ repository_url       = "244530008913.dkr.ecr.eu-west-1.amazonaws.com/ceiv001-ecr" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      ~ image_scanning_configuration {
          ~ scan_on_push = true -> false
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @glennbech, Action: `pull_request`*